test/sinConsologeLog/artillery_fast.txt
Phase started: unnamed (index: 0, duration: 1s) 21:51:08(-0300)

Phase completed: unnamed (index: 0, duration: 1s) 21:51:09(-0300)

--------------------------------------
Metrics for period to: 21:51:10(-0300) (width: 0.983s)
--------------------------------------

http.codes.200: ................................................................ 50
http.request_rate: ............................................................. 51/sec
http.requests: ................................................................. 51
http.response_time:
  min: ......................................................................... 2
  max: ......................................................................... 26
  median: ...................................................................... 2
  p95: ......................................................................... 5
  p99: ......................................................................... 21.1
http.responses: ................................................................ 50
vusers.created: ................................................................ 50
vusers.created_by_name.0: ...................................................... 50


--------------------------------------
Metrics for period to: 21:51:20(-0300) (width: 9.316s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 16
http.codes.200: ................................................................ 1
http.request_rate: ............................................................. 4/sec
http.requests: ................................................................. 34
http.response_time:
  min: ......................................................................... 6750
  max: ......................................................................... 6750
  median: ...................................................................... 6702.6
  p95: ......................................................................... 6702.6
  p99: ......................................................................... 6702.6
http.responses: ................................................................ 1
vusers.failed: ................................................................. 16


--------------------------------------
Metrics for period to: 21:51:30(-0300) (width: 9.58s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 22
http.codes.200: ................................................................ 52
http.request_rate: ............................................................. 5/sec
http.requests: ................................................................. 25
http.response_time:
  min: ......................................................................... 247
  max: ......................................................................... 9506
  median: ...................................................................... 6838
  p95: ......................................................................... 9416.8
  p99: ......................................................................... 9416.8
http.responses: ................................................................ 52
vusers.failed: ................................................................. 22


--------------------------------------
Metrics for period to: 21:51:40(-0300) (width: 9.127s)
--------------------------------------

http.codes.200: ................................................................ 195
http.request_rate: ............................................................. 23/sec
http.requests: ................................................................. 191
http.response_time:
  min: ......................................................................... 247
  max: ......................................................................... 294
  median: ...................................................................... 262.5
  p95: ......................................................................... 290.1
  p99: ......................................................................... 290.1
http.responses: ................................................................ 195
vusers.completed: .............................................................. 12
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 29298.9
  max: ......................................................................... 29911.1
  median: ...................................................................... 29445.4
  p95: ......................................................................... 30040.3
  p99: ......................................................................... 30040.3


All VUs finished. Total time: 31 seconds

--------------------------------
Summary report @ 21:51:39(-0300)
--------------------------------

errors.ETIMEDOUT: .............................................................. 38
http.codes.200: ................................................................ 298
http.request_rate: ............................................................. 11/sec
http.requests: ................................................................. 301
http.response_time:
  min: ......................................................................... 2
  max: ......................................................................... 9506
  median: ...................................................................... 262.5
  p95: ......................................................................... 7117
  p99: ......................................................................... 9416.8
http.responses: ................................................................ 298
vusers.completed: .............................................................. 12
vusers.created: ................................................................ 50
vusers.created_by_name.0: ...................................................... 50
vusers.failed: ................................................................. 38
vusers.session_length:
  min: ......................................................................... 29298.9
  max: ......................................................................... 29911.1
  median: ...................................................................... 29445.4
  p95: ......................................................................... 30040.3
  p99: ......................................................................... 30040.3